Tekla.Structures.Drawing.LineTypes
The LineTypes class defines the possible line types that can be used by the drawing objects.

Tekla.Structures.Drawing.LineTypes.UndefinedLine
The line type is undefined.

Tekla.Structures.Drawing.LineTypes.SolidLine
The solid line (default).

Tekla.Structures.Drawing.LineTypes.DashedLine
The dashed line (-----).

Tekla.Structures.Drawing.LineTypes.SlashedLine
The slashed line (- - -).

Tekla.Structures.Drawing.LineTypes.DashDot
The dash dotted line (--.--.).

Tekla.Structures.Drawing.LineTypes.DottedLine
The dotted line (.....).

Tekla.Structures.Drawing.LineTypes.DashDoubleDot
The dash double dotted line (-..-..-).

Tekla.Structures.Drawing.LineTypes.SlashDash
The slash dash line (-- - -- -).

Tekla.Structures.Drawing.LineTypes.Custom(System.String)
The Custom line type defines a line that is drawn using one of the custom line types, as specified by the CustomLineTypeName.
CustomLineTypeName: A valid custom line type name, if it is not valid an exception will be thrown.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an invalid custom line type name is given.
Returns: The requested custom line type.

Tekla.Structures.Drawing.LineTypes.op_Explicit(System.Int32)~Tekla.Structures.Drawing.LineTypes
Returns the corresponding LineTypes value of the given int value.
value: An int that corresponds to a LineTypes value.
Returns: A LineTypes value that corresponds with the given int.

Tekla.Structures.Drawing.LineTypes.op_Explicit(Tekla.Structures.Drawing.LineTypes)~System.Int32
Returns the corresponding int value of the given LineTypes value.
lineType: The given LineTypes value.
Returns: An int value corresponding to the given LineTypes value.

Tekla.Structures.Drawing.LineTypes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.LineTypes.Equals(System.Object)
Returns true if the current object and the given object are equal.
obj: The object we wish to check the equality with.
Returns: True if the given object equals the current object.

Tekla.Structures.Drawing.LineTypes.GetHashCode
Returns a hash code for the object.
Returns: The hash code for the object.

Tekla.Structures.Drawing.LineTypes.op_Equality(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.LineTypes)
Returns true if the current object and the given object are equal.
a: The first object we wish to check the equality with.
b: The second object we wish to check the equality with.
Returns: True if both objects equals each other.

Tekla.Structures.Drawing.LineTypes.op_Inequality(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.LineTypes)
Returns true if the current object and the given object are not equal.
a: The first object we wish to check the inequality with.
b: The second object we wish to check the inequality with.
Returns: True if the objects are not equal.

Tekla.Structures.Drawing.LineTypes.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2

Tekla.Structures.Drawing.LineTypes.ToString
Returns the LineTypes information as a string.
Returns: The LineTypes information as a string.